blog/2022/sphinx-jsdoc.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 23:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>如何在 Sphinx 下使用 JSDoc</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">如何在 Sphinx 下使用 JSDoc</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org81a3cfb">1. 使用</a></li>
<li><a href="#orgd29e37d">2. 文件结构</a></li>
<li><a href="#org43fb361">3. GitHub Action 自动部署</a></li>
</ul>
</div>
</nav>
<p>
我建了一个仓库，记录自己学习 MDN 网站的过程。我发现了很多函数，它们有参数和返回值，我想着能不能把学习使用过的函数做成一个文档列表，于是我找到了 JSDoc<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>。它能根据 js 源文件生成文档。
</p>

<p>
Sphinx 是 Python 编程语言下的常见文档构建程序。我想把 JSDoc 和它结合起来，于是我找到了 sphinx-js<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>。
</p>

<div id="outline-container-org81a3cfb" class="outline-2">
<h2 id="org81a3cfb"><span class="section-number-2">1</span> 使用</h2>
<div class="outline-text-2" id="text-1">
<p>
确保 Python 版本为 3.8，使用 3.10 会报错：
</p>

<div class="org-src-container">
<pre class="src src-sh">Could not import extension sphinx_js (exception: cannot import name <span style="color: #ddbc91;">'Mapping'</span> from <span style="color: #ddbc91;">'collections'</span> (/usr/lib/python3.10/collections/__init__.py))
</pre>
</div>

<p>
可以将待安装的 pypi 包保存为 requirements.txt：
</p>

<div class="org-src-container">
<pre class="src src-txt">sphinx
sphinx-autobuild
sphinx-js&gt;=3.1
## 以上必选，以下分别是主题，md 文档支持，可不安装
furo
myst-parser
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #706565;"># </span><span style="color: #857575;">&#21019;&#24314;&#34394;&#25311;&#29615;&#22659;&#24182;&#26356;&#26032;&#20381;&#36182;&#21040;&#26368;&#26032;&#29256;&#26412;</span>
python -m venv venv --upgrade-deps
<span style="color: #706565;"># </span><span style="color: #857575;">&#28608;&#27963;&#34394;&#25311;&#29615;&#22659;</span>
. venv/bin/activate
<span style="color: #706565;"># </span><span style="color: #857575;">&#23433;&#35013; pypi &#21253;</span>
pip install -r requirements.txt
</pre>
</div>

<p>
Sphinx 文档配置文件 conf.py：
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #aaca86;">extensions</span> = [
  <span style="color: #ddbc91;">"sphinx_js"</span>
]
<span style="color: #706565;"># </span><span style="color: #857575;">Used to extract JSDoc function/class docs from source</span>
<span style="color: #aaca86;">js_language</span> = <span style="color: #ddbc91;">'javascript'</span>
<span style="color: #aaca86;">js_source_path</span> = <span style="color: #ddbc91;">'../src/'</span>
<span style="color: #706565;"># </span><span style="color: #857575;">jsdoc_config_path = '../tsconfig.json'</span>
<span style="color: #aaca86;">primary_domain</span> = <span style="color: #ddbc91;">'js'</span>
</pre>
</div>

<p>
文档配置 api.rst：
</p>

<div class="org-src-container">
<pre class="src src-rst"><span style="background-color: #262626;">API</span>
<span style="color: #91a0b3;">====</span>

<span style="color: #9fbfdf;">.. autofunction::</span> parseInt
</pre>
</div>

<p>
js 源文件 index.js：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #7c7565;">/** @function parseInt</span>
<span style="color: #7c7565;"> * @param {string} string - value to parse</span>
<span style="color: #7c7565;"> * @param {number} [radix] - integer between 2 and 36. Not default to 10 !!!</span>
<span style="color: #7c7565;"> * @return {(number|NaN)} integer | NaN (radix &lt; 2 or radix &gt; 36 or first non-whitespace character cannot be converted to a number)</span>
<span style="color: #7c7565;"> *</span>
<span style="color: #7c7565;"> * @example</span>
<span style="color: #7c7565;"> * parseInt('0xe', 16)</span>
<span style="color: #7c7565;"> */</span>
</pre>
</div>

<p>
本地预览：
</p>

<div class="org-src-container">
<pre class="src src-sh">sphinx-autobuild content build
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd29e37d" class="outline-2">
<h2 id="orgd29e37d"><span class="section-number-2">2</span> 文件结构</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-txt">.
├── build
├── content
│  ├── _static
│  ├── api.rst
│  ├── conf.py
│  └── index.md
├── Makefile
├── requirements.txt
├── src
│  └── index.js
└── venv
</pre>
</div>
</div>
</div>

<div id="outline-container-org43fb361" class="outline-2">
<h2 id="org43fb361"><span class="section-number-2">3</span> GitHub Action 自动部署</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-yml">name: "Build Sphinx"

on:
  push:
    branches: [main]

jobs:
  docs:
    runs-on: ubuntu-latest
    steps:
    - uses: actions/checkout@v2
    - uses: actions/setup-python@v2
      with:
        python-version: 3.8
    - uses: actions/setup-node@v2
      with:
        node-version: '14'
    - name: Install dependencies
      run: |
          python -m pip install --upgrade pip
          if [ -f requirements.txt ]; then pip install -r requirements.txt; fi
          npm install -g jsdoc
    - name: Clone deploy branch
      run: |
        REMOTE_BRANCH="${REMOTE_BRANCH:-gh-pages}"
        REMOTE_REPO="https://${GITHUB_ACTOR}:${{ secrets.GITHUB_TOKEN }}@github.com/${GITHUB_REPOSITORY}.git"

        rm -rf build/html/
        mkdir -p build/html/
        git clone --depth=1 --branch="${REMOTE_BRANCH}" --single-branch --no-checkout \
          "${REMOTE_REPO}" build/html/
    - run: make html
    - name: Deploy to GitHub Pages
      if: "github.event_name == 'push'"
      run: |
        SOURCE_COMMIT="$(git log -1 --pretty="%an: %B" "$GITHUB_SHA")"
        pushd build/html/ &amp;&gt;/dev/null
        if [ "$(git status --porcelain | wc -l)" -eq 0 ]; then
          exit 0
        fi

        git add --all
        git -c user.name="${GITHUB_ACTOR}" -c user.email="${GITHUB_ACTOR}@users.noreply.github.com" \
          commit --quiet \
          --message "Deploy docs from ${GITHUB_SHA}" \
          --message "$SOURCE_COMMIT"
        git push

        popd &amp;&gt;/dev/null
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/jsdoc/jsdoc">https://github.com/jsdoc/jsdoc</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/mozilla/sphinx-js">https://github.com/mozilla/sphinx-js</a></p></div></div>


</div>
</div></div>
</body>
</html>